import type {Bot} from "grammy";

const welcomeMessage = "📩 /start Message (Persian)\n" +
    "\n" +
    "سلام 👋\n" +
    "به TelbriefBot 🧠 خوش اومدی!\n" +
    "\n" +
    "این ربات طراحی شده تا خلاصه‌ی هوشمند چت‌های گروه رو برات آماده کنه — سریع، دقیق و قابل فهم ✨\n" +
    "\n" +
    "🚀 چی کار می‌کنم؟\n" +
    "\n" +
    "• 📚 ذخیره‌ی پیام‌های گروه به صورت خودکار\n" +
    "• 🧠 تحلیل گفتگو با هوش مصنوعی\n" +
    "• 📝 ارائه‌ی خلاصه‌ی منظم و خوانا\n" +
    "• ⏱️ کمک بهت برای جبران پیام‌های از دست‌رفته\n" +
    "\n" +
    "🛠 چطور استفاده کنم؟\n" +
    "\n" +
    "1️⃣ ربات رو به گروه اضافه کن\n" +
    "2️⃣ مطمئن شو دسترسی خواندن پیام‌ها فعال باشه\n" +
    "3️⃣ هر وقت خواستی، دستور زیر رو بزن:\n" +
    "\n" +
    "/summarize number exp: /summarize 50\n" +
    "\n" +
    "و من آخرین پیام‌های گروه رو برات خلاصه می‌کنم 📌\n" +
    "\n" +
    "🔐 امنیت\n" +
    "\n" +
    "• اطلاعات فقط برای تولید خلاصه استفاده میشه\n" +
    "• هیچ توکنی داخل کد ذخیره نشده\n" +
    "• مدیریت کلیدهای API به صورت امن انجام میشه\n" +
    "\n" +
    "اگه آماده‌ای، من هم آماده‌ام 😉\n" +
    "بریم خلاصه کنیم!";

function startCommandHandle(bot: Bot) {
    bot.command("start", async (ctx) =>{
        ctx.reply(
            welcomeMessage,
            {
                reply_parameters: {
                    message_id: ctx.msg.message_id,
                }
            }
        ).then();
    })
}

export default startCommandHandle;